// #include<stdio.h>

// int main()
// {
//     printf("请输入存钱的数额：\n");
//     double a = 0;
//     scanf("%lf",&a);
//     double b = a*(5*0.03+1);//一次存满5年
//     double b1 = b - a;//一次存满5年利息
//     double c = a*(2*0.021+1)*(3*0.0275+1);//先存两年再存三年与先存三年再存两年相同
//     double c1 = c - a;//二者利息相同
//     double e = a*(0.015+1)*(0.015+1)*(0.015+1)*(0.015+1)*(0.015+1);//每年存一年
//     double e1 = e - a;//每年存一年利息
//     if(b>c && b>e)
//     {
//         printf("一次存满5年最划算,最终金额为：%.2lf\n",b);
//         printf("利息为：%.2lf\n",b1);
//     }
//     else if(c>b && c>e)
//     {
//         printf("先存两年再存三年和先存三年再存两年金额相同，其最划算，都可选择，最终金额为：%.2lf\n",c);
//         printf("利息为：%.2lf\n",c1);
//     }
//     else
//     {
//         printf("每年存一年最划算，最终金额为：%.2lf\n",e);
//         printf("利息为：%.2lf\n",e1);
//     }
//     return 0;
// }